HomeWork-3/reports/128M/withoutIndex/wrk2-R10.txt
Running 5m test @ http://localhost:5000
  4 threads and 5 connections
  Thread calibration: mean lat.: 2262.700ms, rate sampling interval: 9003ms
  Thread calibration: mean lat.: 2649.606ms, rate sampling interval: 9846ms
  Thread calibration: mean lat.: 2208.344ms, rate sampling interval: 9109ms
  Thread calibration: mean lat.: 2218.155ms, rate sampling interval: 9003ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45m    50.85s    3.04m    57.11%
    Req/Sec     0.35      0.48     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.44m 
 75.000%    2.17m 
 90.000%    2.66m 
 99.000%    2.99m 
 99.900%    3.04m 
 99.990%    3.04m 
 99.999%    3.04m 
100.000%    3.04m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5152.767     0.000000            2         1.00
   18710.527     0.100000          114         1.11
   32669.695     0.200000          227         1.25
   52002.815     0.300000          340         1.43
   69271.551     0.400000          454         1.67
   86114.303     0.500000          567         2.00
   93913.087     0.550000          624         2.22
  102367.231     0.600000          680         2.50
  111869.951     0.650000          739         2.86
  121241.599     0.700000          794         3.33
  130154.495     0.750000          850         4.00
  135266.303     0.775000          882         4.44
  138018.815     0.800000          908         5.00
  144572.415     0.825000          938         5.71
  148373.503     0.850000          964         6.67
  153747.455     0.875000          994         8.00
  157286.399     0.887500         1006         8.89
  159514.623     0.900000         1021        10.00
  161611.775     0.912500         1034        11.43
  164626.431     0.925000         1051        13.33
  166330.367     0.937500         1063        16.00
  167772.159     0.943750         1071        17.78
  168558.591     0.950000         1078        20.00
  169607.167     0.956250         1084        22.86
  172228.607     0.962500         1091        26.67
  174063.615     0.968750         1100        32.00
  174981.119     0.971875         1103        35.56
  175243.263     0.975000         1106        40.00
  175505.407     0.978125         1109        45.71
  176029.695     0.981250         1112        53.33
  177733.631     0.984375         1118        64.00
  177733.631     0.985938         1118        71.11
  178520.063     0.987500         1119        80.00
  179568.639     0.989062         1122        91.43
  179830.783     0.990625         1124       106.67
  179961.855     0.992188         1125       128.00
  180617.215     0.992969         1126       142.22
  180617.215     0.993750         1126       160.00
  181534.719     0.994531         1127       182.86
  181927.935     0.995313         1129       213.33
  181927.935     0.996094         1129       256.00
  182059.007     0.996484         1130       284.44
  182059.007     0.996875         1130       320.00
  182059.007     0.997266         1130       365.71
  182190.079     0.997656         1131       426.67
  182190.079     0.998047         1131       512.00
  182321.151     0.998242         1132       568.89
  182321.151     0.998437         1132       640.00
  182321.151     0.998633         1132       731.43
  182321.151     0.998828         1132       853.33
  182321.151     0.999023         1132      1024.00
  182583.295     0.999121         1133      1137.78
  182583.295     1.000000         1133          inf
#[Mean    =    87102.666, StdDeviation   =    50853.591]
#[Max     =   182452.224, Total count    =         1133]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  913.92ms
 75.000%    1.43s 
 90.000%    1.94s 
 99.000%    2.83s 
 99.900%    3.81s 
 99.990%    4.11s 
 99.999%    4.11s 
100.000%    4.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.649     0.000000            1         1.00
     183.551     0.100000          114         1.11
     394.239     0.200000          227         1.25
     608.255     0.300000          340         1.43
     769.535     0.400000          454         1.67
     913.919     0.500000          567         2.00
    1030.655     0.550000          624         2.22
    1133.567     0.600000          680         2.50
    1231.871     0.650000          738         2.86
    1316.863     0.700000          794         3.33
    1434.623     0.750000          850         4.00
    1520.639     0.775000          879         4.44
    1588.223     0.800000          907         5.00
    1675.263     0.825000          935         5.71
    1741.823     0.850000          965         6.67
    1820.671     0.875000          992         8.00
    1871.871     0.887500         1006         8.89
    1943.551     0.900000         1020        10.00
    2021.375     0.912500         1034        11.43
    2089.983     0.925000         1049        13.33
    2187.263     0.937500         1064        16.00
    2220.031     0.943750         1070        17.78
    2306.047     0.950000         1077        20.00
    2340.863     0.956250         1084        22.86
    2398.207     0.962500         1091        26.67
    2465.791     0.968750         1098        32.00
    2549.759     0.971875         1102        35.56
    2588.671     0.975000         1105        40.00
    2611.199     0.978125         1109        45.71
    2662.399     0.981250         1113        53.33
    2689.023     0.984375         1116        64.00
    2715.647     0.985938         1118        71.11
    2762.751     0.987500         1119        80.00
    2830.335     0.989062         1121        91.43
    2883.583     0.990625         1123       106.67
    3162.111     0.992188         1126       128.00
    3162.111     0.992969         1126       142.22
    3162.111     0.993750         1126       160.00
    3233.791     0.994531         1127       182.86
    3284.991     0.995313         1128       213.33
    3299.327     0.996094         1129       256.00
    3303.423     0.996484         1130       284.44
    3303.423     0.996875         1130       320.00
    3303.423     0.997266         1130       365.71
    3342.335     0.997656         1131       426.67
    3342.335     0.998047         1131       512.00
    3809.279     0.998242         1132       568.89
    3809.279     0.998437         1132       640.00
    3809.279     0.998633         1132       731.43
    3809.279     0.998828         1132       853.33
    3809.279     0.999023         1132      1024.00
    4110.335     0.999121         1133      1137.78
    4110.335     1.000000         1133          inf
#[Mean    =     1021.962, StdDeviation   =      684.644]
#[Max     =     4108.288, Total count    =         1133]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1188 requests in 5.00m, 1.51MB read
Requests/sec:      3.96
Transfer/sec:      5.14KB