HomeWork-3/reports/128M/withoutIndex/wrk2-R100.txt
Running 5m test @ http://localhost:5000
  8 threads and 50 connections
  Thread calibration: mean lat.: 3409.749ms, rate sampling interval: 10985ms
  Thread calibration: mean lat.: 3923.114ms, rate sampling interval: 11010ms
  Thread calibration: mean lat.: 4650.496ms, rate sampling interval: 14082ms
  Thread calibration: mean lat.: 3946.666ms, rate sampling interval: 10977ms
  Thread calibration: mean lat.: 4132.352ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 4101.290ms, rate sampling interval: 12468ms
  Thread calibration: mean lat.: 4063.829ms, rate sampling interval: 12435ms
  Thread calibration: mean lat.: 3470.506ms, rate sampling interval: 9887ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.55m     1.32m    4.81m    57.55%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.56m 
 75.000%    3.72m 
 90.000%    4.36m 
 99.000%    4.74m 
 99.900%    4.81m 
 99.990%    4.81m 
 99.999%    4.81m 
100.000%    4.81m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9822.207     0.000000            1         1.00
   41025.535     0.100000          120         1.11
   72482.815     0.200000          240         1.25
   99352.575     0.300000          358         1.43
  125042.687     0.400000          477         1.67
  153747.455     0.500000          597         2.00
  166461.439     0.550000          657         2.22
  187301.887     0.600000          716         2.50
  197263.359     0.650000          775         2.86
  211943.423     0.700000          835         3.33
  223084.543     0.750000          894         4.00
  230424.575     0.775000          924         4.44
  236191.743     0.800000          954         5.00
  241565.695     0.825000          984         5.71
  247201.791     0.850000         1014         6.67
  256507.903     0.875000         1043         8.00
  259129.343     0.887500         1058         8.89
  261881.855     0.900000         1073        10.00
  263323.647     0.912500         1088        11.43
  265289.727     0.925000         1103        13.33
  269484.031     0.937500         1119        16.00
  271056.895     0.943750         1125        17.78
  273678.335     0.950000         1133        20.00
  275513.343     0.956250         1141        22.86
  278396.927     0.962500         1149        26.67
  279445.503     0.968750         1155        32.00
  280231.935     0.971875         1159        35.56
  280494.079     0.975000         1163        40.00
  281542.655     0.978125         1166        45.71
  282853.375     0.981250         1170        53.33
  283901.951     0.984375         1175        64.00
  284164.095     0.985938         1176        71.11
  284688.383     0.987500         1180        80.00
  284688.383     0.989062         1180        91.43
  285474.815     0.990625         1181       106.67
  285736.959     0.992188         1183       128.00
  286261.247     0.992969         1186       142.22
  286261.247     0.993750         1186       160.00
  286261.247     0.994531         1186       182.86
  286785.535     0.995313         1188       213.33
  286785.535     0.996094         1188       256.00
  286785.535     0.996484         1188       284.44
  287309.823     0.996875         1189       320.00
  287309.823     0.997266         1189       365.71
  288096.255     0.997656         1190       426.67
  288096.255     0.998047         1190       512.00
  288096.255     0.998242         1190       568.89
  288620.543     0.998437         1192       640.00
  288620.543     1.000000         1192          inf
#[Mean    =   153184.713, StdDeviation   =    79216.597]
#[Max     =   288358.400, Total count    =         1192]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   11.40s 
 75.000%   17.14s 
 90.000%   21.33s 
 99.000%   26.59s 
 99.900%   30.21s 
 99.990%   31.90s 
 99.999%   31.90s 
100.000%   31.90s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.057     0.000000            1         1.00
    1841.151     0.100000          120         1.11
    5214.207     0.200000          239         1.25
    7073.791     0.300000          358         1.43
    9011.199     0.400000          477         1.67
   11395.071     0.500000          596         2.00
   12681.215     0.550000          658         2.22
   14082.047     0.600000          716         2.50
   14974.975     0.650000          775         2.86
   16130.047     0.700000          835         3.33
   17137.663     0.750000          894         4.00
   17743.871     0.775000          924         4.44
   18350.079     0.800000          954         5.00
   19021.823     0.825000          984         5.71
   19726.335     0.850000         1016         6.67
   20447.231     0.875000         1043         8.00
   20758.527     0.887500         1058         8.89
   21331.967     0.900000         1073        10.00
   21757.951     0.912500         1088        11.43
   22151.167     0.925000         1103        13.33
   22446.079     0.937500         1118        16.00
   22527.999     0.943750         1125        17.78
   22708.223     0.950000         1134        20.00
   22937.599     0.956250         1140        22.86
   23199.743     0.962500         1148        26.67
   24035.327     0.968750         1155        32.00
   24166.399     0.971875         1159        35.56
   24575.999     0.975000         1163        40.00
   25214.975     0.978125         1166        45.71
   25493.503     0.981250         1171        53.33
   25690.111     0.984375         1174        64.00
   26230.783     0.985938         1176        71.11
   26296.319     0.987500         1178        80.00
   26312.703     0.989062         1179        91.43
   26591.231     0.990625         1181       106.67
   27951.103     0.992188         1183       128.00
   28114.943     0.992969         1184       142.22
   28164.095     0.993750         1185       160.00
   28246.015     0.994531         1186       182.86
   29114.367     0.995313         1187       213.33
   29622.271     0.996094         1188       256.00
   29622.271     0.996484         1188       284.44
   29982.719     0.996875         1189       320.00
   29982.719     0.997266         1189       365.71
   30179.327     0.997656         1190       426.67
   30179.327     0.998047         1190       512.00
   30179.327     0.998242         1190       568.89
   30212.095     0.998437         1191       640.00
   30212.095     0.998633         1191       731.43
   30212.095     0.998828         1191       853.33
   30212.095     0.999023         1191      1024.00
   30212.095     0.999121         1191      1137.78
   31899.647     0.999219         1192      1280.00
   31899.647     1.000000         1192          inf
#[Mean    =    11675.323, StdDeviation   =     7038.245]
#[Max     =    31883.264, Total count    =         1192]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1217 requests in 5.00m, 1.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:      4.05
Transfer/sec:      5.25KB